# CheckAnalyticalConsistency Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
AnalyticalConsistencyChecking..::..CheckAnalyticalConsistency Method
AnalyticalConsistencyChecking Class See Also
---
Checks consistency of the Analytical Model.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
# Syntax
C#
---
```text
public static bool CheckAnalyticalConsistency(
	Document document
)
```

Visual Basic
---
```text
Public Shared Function CheckAnalyticalConsistency ( _
	document As Document _
) As Boolean
```

Visual C++
---
```text
public:
static bool CheckAnalyticalConsistency(
	Document^ document
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document Document in which to perform consistency checks.
# ### Return Value
True if run succeeded, false otherwise.
# Remarks
Existence of inconsistencies will not affect the return value. If inconsistencies are found, Revit will post warnings regarding those inconsistencies. This should be run from within a transaction.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
AnalyticalConsistencyChecking Class
Autodesk.Revit.DB.Structure Namespace